pgfds-metrics/old_logs/benchmark_logs/20250320_172233/benchmark_100_rps.log
Running 5m test @ http://localhost:5000
  4 threads and 100 connections
  Thread calibration: mean lat.: 45.780ms, rate sampling interval: 259ms
  Thread calibration: mean lat.: 47.393ms, rate sampling interval: 289ms
  Thread calibration: mean lat.: 43.289ms, rate sampling interval: 254ms
  Thread calibration: mean lat.: 53.193ms, rate sampling interval: 305ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    42.28ms   70.98ms 527.87ms   88.46%
    Req/Sec    24.75     32.47    98.00     78.09%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    7.89ms
 75.000%   52.13ms
 90.000%  129.41ms
 99.000%  326.91ms
 99.900%  413.95ms
 99.990%  478.98ms
 99.999%  528.38ms
100.000%  528.38ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.492     0.000000            1         1.00
       2.147     0.100000         2896         1.11
       2.989     0.200000         5789         1.25
       4.031     0.300000         8683         1.43
       5.475     0.400000        11587         1.67
       7.895     0.500000        14471         2.00
      10.079     0.550000        15918         2.22
      13.951     0.600000        17364         2.50
      22.207     0.650000        18810         2.86
      37.567     0.700000        20259         3.33
      52.127     0.750000        21706         4.00
      59.999     0.775000        22428         4.44
      67.583     0.800000        23156         5.00
      76.991     0.825000        23878         5.71
      88.959     0.850000        24598         6.67
     105.215     0.875000        25322         8.00
     116.095     0.887500        25683         8.89
     129.471     0.900000        26048        10.00
     146.943     0.912500        26406        11.43
     167.039     0.925000        26768        13.33
     190.847     0.937500        27133        16.00
     201.727     0.943750        27311        17.78
     214.015     0.950000        27493        20.00
     228.479     0.956250        27673        22.86
     241.407     0.962500        27855        26.67
     255.359     0.968750        28035        32.00
     263.167     0.971875        28129        35.56
     270.847     0.975000        28218        40.00
     278.527     0.978125        28305        45.71
     287.743     0.981250        28396        53.33
     299.519     0.984375        28488        64.00
     305.663     0.985938        28532        71.11
     312.575     0.987500        28579        80.00
     321.023     0.989062        28622        91.43
     330.495     0.990625        28667       106.67
     339.199     0.992188        28712       128.00
     343.039     0.992969        28735       142.22
     347.903     0.993750        28759       160.00
     355.327     0.994531        28780       182.86
     363.775     0.995313        28803       213.33
     372.735     0.996094        28826       256.00
     376.063     0.996484        28837       284.44
     379.903     0.996875        28849       320.00
     385.791     0.997266        28859       365.71
     392.447     0.997656        28874       426.67
     396.031     0.998047        28882       512.00
     398.847     0.998242        28890       568.89
     400.127     0.998437        28893       640.00
     406.271     0.998633        28899       731.43
     410.111     0.998828        28906       853.33
     413.951     0.999023        28910      1024.00
     417.023     0.999121        28913      1137.78
     419.583     0.999219        28916      1280.00
     423.167     0.999316        28919      1462.86
     430.591     0.999414        28923      1706.67
     432.639     0.999512        28924      2048.00
     438.015     0.999561        28926      2275.56
     439.807     0.999609        28927      2560.00
     444.927     0.999658        28929      2925.71
     445.183     0.999707        28930      3413.33
     465.151     0.999756        28931      4096.00
     468.479     0.999780        28932      4551.11
     470.527     0.999805        28933      5120.00
     470.783     0.999829        28934      5851.43
     470.783     0.999854        28934      6826.67
     478.975     0.999878        28935      8192.00
     478.975     0.999890        28935      9102.22
     480.767     0.999902        28936     10240.00
     480.767     0.999915        28936     11702.86
     480.767     0.999927        28936     13653.33
     498.687     0.999939        28937     16384.00
     498.687     0.999945        28937     18204.44
     498.687     0.999951        28937     20480.00
     498.687     0.999957        28937     23405.71
     498.687     0.999963        28937     27306.67
     528.383     0.999969        28938     32768.00
     528.383     1.000000        28938          inf
#[Mean    =       42.280, StdDeviation   =       70.976]
#[Max     =      527.872, Total count    =        28938]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  30004 requests in 5.00m, 40.92MB read
Requests/sec:    100.01
Transfer/sec:    139.66KB